// 

namespace WinLib
{
    ////(0)Stretch - растяжение//(1)Bend - изгиб//(2)Twist - кручение//(3)Cut - срез//(4)Crush - смятие
    //public enum panel { Stretch, Bend, Twist, Cut, Crush };

    //// (0)static - статическая // (1)pulsate - от нуля до мах. // (2)alternate - знакопеременная
    //public enum load { Static, Pulsate, Alternate };

    // определение структуры стали (типа данных)
    public struct Steel
    {
        public string steelName;                	// Марка стали             
        public double ultimate_Strength;        	// Временное сопротивление 
        public double yield_Strength;           	// Предел текучести        
        public double static_Stretch_Stress_Max;    // Доп.напр.при стат нагрузке Stretch-растяжение 
        public double pulsate_Stretch_Stress_Max;  	// Доп. напр. при пульсирующей нагрузке      
        public double alternate_Stretch_Stress_Max; // Доп. напр. при знакопеременной нагрузке   
        public double static_Bend_Stress_Max;       // Доп напр при стат нагрузке	Bend - изгиб 
        public double pulsate_Bend_Stress_Max;  	// Доп. напр. при пульсирующей нагрузке      
        public double alternate_Bend_Stress_Max; 	// Доп. напр. при знакопеременной нагрузке   
        public double static_Twist_Stress_Max;      // Доп.напр.при стат нагрузке Twist - кручение 
        public double pulsate_Twist_Stress_Max;  	// Доп. напр. при пульсирующей нагрузке      
        public double alternate_Twist_Stress_Max;   // Доп. напр. при знакопеременной нагрузке   
        public double static_Cut_Stress_Max;   	    // Доп.напр.при стат нагрузке Cut - срез     
        public double pulsate_Cut_Stress_Max;  		// Доп. напр. при пульсирующей нагрузке      
        public double alternate_Cut_Stress_Max; 	// Доп. напр. при знакопеременной нагрузке   
        public double static_Crush_Stress_Max;      // Доп.напр. при стат нагрузке Crush - смятие
        public double pulsate_Crush_Stress_Max;  	// Доп. напр. при пульсирующей нагрузке      

        // конструктор структуры
        public Steel(string a1, double a2, double a3, double b1, double b2, double b3, double c1, double c2, double c3, double d1, double d2, double d3, double e1, double e2, double e3, double f1, double f2)
        {
            steelName = a1;
            ultimate_Strength = a2;     // Временное сопротивление
            yield_Strength = a3;        // Предел текучести
            static_Stretch_Stress_Max = b1;     // Stretch - растяжение
            pulsate_Stretch_Stress_Max = b2;
            alternate_Stretch_Stress_Max = b3;
            static_Bend_Stress_Max = c1;        // Bend - изгиб
            pulsate_Bend_Stress_Max = c2;
            alternate_Bend_Stress_Max = c3;
            static_Twist_Stress_Max = d1;       // Twist - кручение
            pulsate_Twist_Stress_Max = d2;
            alternate_Twist_Stress_Max = d3;
            static_Cut_Stress_Max = e1;         // Cut - срез
            pulsate_Cut_Stress_Max = e2;
            alternate_Cut_Stress_Max = e3;
            static_Crush_Stress_Max = f1;       // Crush - смятие
            pulsate_Crush_Stress_Max = f2;
        }   // end of - конструктор структуры
    }       // end of - struct Steel



    public class SteelData
    {
        // определение данных
        public Steel[] steels = new[]  // массив структур
        {
new Steel("сталь 3          ", 370.0, 245.0, 125.0,  90.0,  70.0, 150.0, 110.0,  85.0,  95.0,  65.0,  50.0,  75.0,  50.0,  40.0, 190.0, 135.0),
new Steel("сталь 08 (Н)     ", 330.0, 200.0, 110.0,  80.0,  60.0, 130.0,  95.0,  75.0,  80.0,  60.0,  45.0,  60.0,  45.0,  35.0, 165.0, 120.0),
new Steel("сталь 10 (Н)     ", 340.0, 210.0, 110.0,  80.0,  60.0, 145.0, 100.0,  75.0,  80.0,  60.0,  45.0,  65.0,  45.0,  35.0, 165.0, 120.0),
new Steel("сталь 10 (Ц-В59) ", 400.0, 250.0, 130.0,  90.0,  70.0, 155.0, 115.0,  90.0, 100.0,  65.0,  55.0,  70.0,  50.0,  40.0, 195.0, 135.0),
new Steel("сталь 15 (Н)     ", 380.0, 230.0, 125.0,  85.0,  65.0, 150.0, 110.0,  85.0,  95.0,  65.0,  50.0,  75.0,  50.0,  40.0, 185.0, 125.0),
new Steel("сталь 15 (Ц-В59) ", 450.0, 250.0, 145.0,  95.0,  80.0, 175.0, 125.0, 100.0, 110.0,  80.0,  60.0,  85.0,  60.0,  45.0, 210.0, 175.0),
new Steel("сталь 20 (Н)     ", 420.0, 250.0, 140.0, 115.0,  95.0, 170.0, 120.0,  95.0, 105.0,  70.0,  55.0,  85.0,  60.0,  45.0, 210.0, 175.0),
new Steel("сталь 20 (Ц-В59) ", 500.0, 300.0, 165.0, 120.0, 100.0, 200.0, 140.0, 110.0, 125.0,  75.0,  55.0, 100.0,  60.0,  45.0, 240.0, 175.0),
new Steel("сталь 25 (Н)     ", 460.0, 280.0, 150.0, 110.0,  85.0, 180.0, 130.0, 105.0, 110.0,  80.0,  60.0,  90.0,  65.0,  50.0, 220.0, 165.0),
new Steel("сталь 25 (Ц-В58) ", 550.0, 350.0, 180.0, 130.0, 100.0, 210.0, 160.0, 125.0, 135.0,  95.0,  75.0, 110.0,  80.0,  60.0, 270.0, 195.0),
new Steel("сталь 30 (Н)     ", 500.0, 300.0, 165.0, 115.0,  90.0, 200.0, 140.0, 110.0, 125.0,  90.0,  70.0, 100.0,  65.0,  55.0, 240.0, 175.0),
new Steel("сталь 30 (У)     ", 600.0, 350.0, 200.0, 140.0, 105.0, 240.0, 175.0, 135.0, 150.0, 105.0,  80.0, 120.0,  85.0,  65.0, 300.0, 210.0),
new Steel("сталь 35 (Н)     ", 540.0, 320.0, 180.0, 125.0,  95.0, 210.0, 155.0, 120.0, 135.0,  90.0,  70.0, 110.0,  75.0,  55.0, 270.0, 190.0),
new Steel("сталь 35 (У)     ", 650.0, 380.0, 210.0, 150.0, 115.0, 260.0, 185.0, 145.0, 160.0, 110.0,  85.0, 130.0,  90.0,  70.0, 520.0, 220.0),
new Steel("сталь 35 (В35)   ",1000.0, 650.0, 330.0, 230.0, 180.0, 400.0, 290.0, 220.0, 250.0, 165.0, 135.0, 200.0, 140.0, 110.0, 500.0, 350.0),
new Steel("сталь 40 (Н)     ", 580.0, 340.0, 190.0, 130.0, 105.0, 230.0, 165.0, 130.0, 140.0, 100.0,  75.0, 115.0,  80.0,  60.0, 280.0, 200.0),
new Steel("сталь 40 (У)     ", 700.0, 400.0, 230.0, 160.0, 125.0, 270.0, 200.0, 155.0, 170.0, 120.0,  95.0, 140.0, 100.0,  80.0, 320.0, 240.0),
new Steel("сталь 40 (В35)   ",1000.0, 650.0, 340.0, 230.0, 180.0, 400.0, 290.0, 220.0, 250.0, 175.0, 135.0, 200.0, 140.0, 110.0, 500.0, 350.0),
new Steel("сталь 45 (Н)     ", 610.0, 360.0, 200.0, 140.0, 110.0, 240.0, 175.0, 135.0, 150.0, 105.0,  80.0, 125.0,  85.0,  65.0, 300.0, 210.0),
new Steel("сталь 45 (У)     ", 750.0, 450.0, 240.0, 170.0, 135.0, 290.0, 215.0, 170.0, 185.0, 130.0, 100.0, 145.0, 105.0,  80.0, 360.0, 260.0),
new Steel("сталь 45 (М35)   ", 900.0, 650.0, 300.0, 210.0, 160.0, 360.0, 260.0, 200.0, 230.0, 165.0, 120.0, 185.0, 125.0,  95.0, 450.0, 310.0),
new Steel("сталь 45 (В42)   ",1000.0, 700.0, 300.0, 210.0, 160.0, 360.0, 260.0, 200.0, 230.0, 160.0, 120.0, 185.0, 125.0,  95.0, 750.0, 310.0),
new Steel("сталь 45 (В48)   ",1200.0, 950.0, 400.0, 280.0, 210.0, 480.0, 340.0, 270.0, 300.0, 210.0, 160.0, 240.0, 170.0, 130.0, 600.0, 420.0),
new Steel("сталь 45 (ТВЧ56) ", 750.0, 450.0, 240.0, 170.0, 135.0, 290.0, 210.0, 170.0, 185.0, 130.0, 100.0, 145.0, 105.0,  80.0, 360.0, 260.0),
new Steel("сталь 09Г2С (-)  ", 500.0, 350.0, 170.0, 120.0,  95.0, 200.0, 150.0, 120.0, 125.0,  90.0,  70.0, 100.0,  70.0,  55.0, 250.0, 180.0),
new Steel("сталь 10ХСНД (-) ", 540.0, 400.0, 185.0, 140.0, 110.0, 220.0, 160.0, 135.0, 140.0, 100.0,  80.0, 110.0,  80.0,  65.0, 280.0, 210.0),
new Steel("сталь 20Х (Н)    ", 600.0, 300.0, 190.0, 135.0, 105.0, 230.0, 165.0, 130.0, 140.0, 100.0,  75.0, 115.0,  85.0,  60.0, 280.0, 200.0),
new Steel("сталь 20Х (У)    ", 700.0, 500.0, 240.0, 175.0, 140.0, 290.0, 220.0, 175.0, 180.0, 130.0, 100.0, 145.0, 100.0,  80.0, 360.0, 260.0),
new Steel("сталь 20Х (М59)  ", 850.0, 630.0, 290.0, 210.0, 170.0, 350.0, 210.0, 145.0, 220.0, 155.0, 120.0, 175.0, 125.0,  95.0, 430.0, 320.0),
new Steel("сталь 40Х (Н)    ", 630.0, 330.0, 200.0, 155.0, 125.0, 240.0, 190.0, 155.0, 150.0, 115.0,  90.0, 120.0,  95.0,  75.0, 300.0, 230.0),
new Steel("сталь 40Х (У)    ", 800.0, 650.0, 270.0, 200.0, 160.0, 320.0, 250.0, 200.0, 200.0, 150.0, 115.0, 160.0, 115.0,  90.0, 400.0, 300.0),
new Steel("сталь 40Х (М39)  ",1100.0, 900.0, 200.0, 155.0, 125.0, 450.0, 340.0, 270.0, 280.0, 200.0, 160.0, 230.0, 165.0, 130.0, 560.0, 420.0),
new Steel("сталь 40Х (М48)  ",1300.0,1100.0, 440.0, 330.0, 260.0, 530.0, 410.0, 320.0, 330.0, 240.0, 190.0, 270.0, 195.0, 150.0, 670.0, 490.0),   // д.б. после сталь 40Х (М39)
new Steel("сталь 50Х (Н)    ", 650.0, 350.0, 210.0, 160.0, 130.0, 250.0, 200.0, 160.0, 160.0, 120.0, 90.0, 125.0, 90.0, 70.0, 360.0, 240.0),
new Steel("сталь 50Х (М48)  ",1500.0, 1300.0, 500.0, 370.0, 300.0, 600.0, 460.0, 370.0, 370.0, 270.0, 210.0, 300.0, 220.0, 170.0, 750.0, 550.0),
new Steel("сталь 18ХГТ (Н)  ",700.0, 430.0, 230.0, 175.0, 140.0, 270.0, 210.0, 175.0, 170.0, 125.0, 100.0, 140.0, 100.0, 80.0, 340.0, 260.0),
new Steel("сталь 18ХГТ (Ц-М59)",1000.0, 800.0, 330.0, 250.0, 200.0, 400.0, 310.0, 250.0, 250.0, 185.0, 145.0, 200.0, 145.0, 115.0, 490.0, 380.0),
new Steel("сталь 30ХГТ (М43) ",1250.0, 1050.0, 430.0, 310.0, 250.0, 510.0, 390.0, 310.0, 320.0, 230.0, 180.0, 260.0, 185.0, 140.0, 640.0, 460.0),
new Steel("сталь 30ХГТ (Ц-М59)  ",1100.0, 800.0, 370.0, 270.0, 220.0, 440.0, 340.0, 270.0, 280.0, 200.0, 160.0, 220.0, 160.0, 125.0, 550.0, 410.0),
new Steel("сталь 30ХМ (М)  ",950.0, 750.0, 320.0, 240.0, 190.0, 390.0, 300.0, 240.0, 240.0, 155.0, 115.0, 190.0, 125.0, 90.0, 480.0, 360.0),
new Steel("сталь 12ХН3А (У)  ",950.0, 700.0, 320.0, 240.0, 190.0, 380.0, 280.0, 230.0, 240.0, 175.0, 140.0, 190.0, 140.0, 110.0, 480.0, 300.0),
new Steel("сталь 12ХН3А (ТВЧ59)  ",1000.0, 850.0, 340.0, 260.0, 200.0, 410.0, 310.0, 250.0, 240.0, 175.0, 140.0, 190.0, 140.0, 110.0, 480.0, 300.0),
new Steel("сталь 20Х13 (Н)  ",650.0, 440.0, 320.0, 240.0, 190.0, 380.0, 280.0, 230.0, 240.0, 175.0, 140.0, 190.0, 140.0, 110.0, 480.0, 300.0),
new Steel("сталь 20Х13 (У)  ",830.0, 635.0, 320.0, 240.0, 190.0, 380.0, 280.0, 230.0, 240.0, 175.0, 140.0, 190.0, 140.0, 110.0, 480.0, 300.0)

    };


    }   // end of - class Steel
}       // end of - namespace WinLib
